tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jayadamsmorgan/yatoro"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "pomdtr/tap"
tap "tinygo-org/tools"
tap "whatpulse/whatpulse"
tap "zackelia/formulae"
tap "zegervdv/zathura"

brew "python@3.12"
brew "icu4c@76"
brew "age"
brew "arduino-cli"
brew "fzf"
brew "arttime"
brew "baobab"
brew "bash"
brew "node"
brew "bash-language-server"
brew "bat"
brew "biber"
brew "bibtex-tidy"
brew "btop"
brew "cbonsai"
brew "chezmoi"
brew "clang-format"
brew "clib"
brew "cmake"
brew "cmake-docs"
brew "cmake-language-server"
brew "cmatrix"
brew "delve"
brew "deno"
brew "devcontainer"
brew "diff-so-fancy"
brew "dooit"
brew "exiftool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "gmp"
brew "ffmpegthumbnailer"
brew "figlet"
brew "fish"
brew "fisher"
brew "gcc"
brew "gdb"
brew "gh"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "gopass"
brew "helix"
brew "hexyl"
brew "iftop"
brew "jp2a"
brew "jq"
brew "jrnl"
brew "just"
brew "kondo"
brew "lazygit"
brew "pkgconf"
brew "llvm"
brew "lsd"
brew "lua"
brew "macos-trash", link: true
brew "make"
brew "markdown-oxide"
brew "marksman"
brew "mas"
brew "mdcat"
brew "media-info"
brew "micro"
brew "mosh"
brew "mprocs"
brew "ncdu"
brew "neovim"
brew "nmap"
brew "nowplaying-cli"
brew "nushell"
brew "nvm"
brew "openjdk"
brew "openssh"
brew "ouch"
brew "parallel-disk-usage"
brew "pipx"
brew "platformio"
brew "podman"
brew "podman-tui"
brew "prettier"
brew "qpdf"
brew "rich-cli"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "sd"
brew "sevenzip"
brew "starship"
brew "switchaudio-osx"
brew "taplo"
brew "tectonic"
brew "texlab"
brew "tio"
brew "tldr"
brew "tmux"
brew "toilet"
brew "tokei"
brew "tree"
brew "typos-cli"
brew "typos-lsp"
brew "vit"
brew "vscode-langservers-extracted"
brew "watchexec"
brew "xdg-ninja", args: ["HEAD"]
brew "yaml-language-server"
brew "yamllint"
brew "yarn"
brew "yazi"
brew "yq"
brew "zellij"
brew "zig"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "jayadamsmorgan/yatoro/yatoro"
brew "koekeishiya/formulae/skhd"
brew "pomdtr/tap/sunbeam"
brew "tinygo-org/tools/tinygo"
brew "zackelia/formulae/bclm"
brew "zegervdv/zathura/synctex"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-pdf-mupdf"
brew "zegervdv/zathura/zathura-pdf-poppler"

cask "aerospace"
cask "alacritty"
cask "arduino-ide"
cask "autodesk-fusion"
cask "bambu-studio"
cask "claude"
cask "clop"
cask "disk-expert"
cask "docker"
cask "font-hack-nerd-font"
cask "ghostty"
cask "gimp"
cask "hot"
cask "karabiner-elements"
cask "kitty"
cask "marta"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "moonlight"
cask "orcaslicer"
cask "pika"
cask "podman-desktop"
cask "rar"
cask "raycast"
cask "reminders-menubar"
cask "screen-studio"
cask "sf-symbols"
cask "simpletex"
cask "sip"
cask "skim"
cask "slimhud"
cask "stats"
cask "ubersicht"
cask "unnaturalscrollwheels"
cask "wezterm"
cask "whatpulse"
cask "whatpulse_chmodbpf"
cask "zotero"

mas "AdBlock", id: 1402042596
mas "eduVPN", id: 1317704208
mas "Hand Mirror", id: 1502839586
mas "Keynote", id: 409183694
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Steam Link", id: 1246969117

